Revit 2027 API
PushButton.AvailabilityClassName Property
The full class name for the class providing the entry point to decide availability of this push button.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AvailabilityClassName { get; set; }
Public Property AvailabilityClassName As String
	Get
	Set
public:
property String^ AvailabilityClassName {
	String^ get ();
	void set (String^ value);
}
member AvailabilityClassName : string with get, set
Property Value
String
Remarks
This is the class implementing IExternalCommandAvailability interface.
See Also
Reference
PushButton Class
Autodesk.Revit.UI Namespace